STMicroelectronics/STM32CubeU5/Utilities/lpbam/stm32_adv_lpbam_i2c.c
/**
  **********************************************************************************************************************
  * @file    stm32_adv_lpbam_i2c.c
  * @author  MCD Application Team
  * @brief   This file provides the advanced LPBAM layer for I2C peripheral.
  **********************************************************************************************************************
  * @attention
  *
  * Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  **********************************************************************************************************************
  @verbatim
  ======================================================================================================================
                                 ############### How to use this driver ###############
  ======================================================================================================================
    [..]
      It is strongly recommended to read carefully the LPBAM_Utility_GettingStarted.html document before starting
      developing an LPBAM application.

    *** Driver description ***
    ==========================
    [..]
      This driver is dedicated for I2C that can change registers configuration through a DMA linked-list queue instead
      of using CPU, which allows I2C peripheral to operate in low power mode.
      This advanced LPBAM module counts 3 files :
          (+) stm32_adv_lpbam_i2c.c
              (++) This file provides the I2C advanced files body.
          (+) stm32_adv_lpbam_i2c.h
              (++) This file is the header file of stm32_adv_lpbam_i2c.c It provides used types
          (+) stm32_platform_lpbam_i2c.h
              (++) This header file contains all defines to be used within applicative side.

    *** Driver features ***
    =======================
    [..]
      This driver provides the following list of features :
          (+) Configure the I2C transfers in master and slave modes.
          (+) Starts the I2C transfers in master and slave modes.
          (+) Configure and starts the I2C transfers in master and slave modes.
          (+) Manage sequential transfers on each driver API.
          (+) Manage reloaded transfers on each driver API.

    *** Functional description ***
    ==============================
    [..]
      The I2C peripheral transfer is configured through a DMA channel thanks to a build DMA linked-list queue in master
      and slave mode.
      The I2C peripheral transfer is started through a DMA channel thanks to a build DMA linked-list queue in master
      and slave mode.
      The I2C peripheral transfer is configured and started through a DMA channel thanks to a build DMA linked-list
      queue in master and slave mode.

      The output of this driver is a queue to be executed by the DMA channel.

    [..]
      This driver allows to operate several transfers by setting SequenceNumber parameter and handle a transfers with
      data size greater than 255 bytes thanks to reload mode.

    [..]
      SequenceNumber parameter should reflect the number of expected transfers, otherwise the bus will remain in busy
      state.

    [..]
      When sequential transfer is activated (SequenceNumber > 1), a transfer with data size greater than 255 bytes is
      considered as one sequence and ADV_LPBAM_I2C_[Master/Slave][Tx/Rx]_SetDataQ() should be called x time where
      x = SequenceNumber.
      The same when using ADV_LPBAM_I2C_[Master/Slave][Tx/Rx]_SetFullQ() API. Refer to Driver user sequence for further
      information about APIs usage.

    [..]
      The maximum data size could be sent at each call is 255 bytes. Consequently when data size is greater than 255,
      the ADV_LPBAM_I2C_[Master/Slave][Tx/Rx]_SetDataQ() API should be called y time where y is the integer part of
      ((Size)/255) + 1 (same when using ADV_LPBAM_I2C_[Master/Slave][Tx/Rx]_SetFullQ() API).
      Refer to Driver user sequence for further information about APIs usage.

    *** Driver APIs description ***
    ===============================
    [..]
      Use ADV_LPBAM_I2C_MasterTx_SetConfigQ() API to build a linked-list queue that setup the I2C master configuration
      transmission operation according to parameters in the LPBAM_I2C_ConfigAdvConf_t structure.

    [..]
      Use ADV_LPBAM_I2C_MasterTx_SetDataQ() API to build a linked-list queue that setup the I2C master transmission
      starting operation according to parameters in the LPBAM_I2C_DataAdvConf_t structure.
      The data node default configuration is as follow:
          (+) SrcInc            : DMA_SINC_INCREMENTED.
          (+) DestInc           : DMA_DINC_FIXED. (Mandatory)
          (+) SrcDataWidth      : DMA_SRC_DATAWIDTH_BYTE.
          (+) DestDataWidth     : DMA_DEST_DATAWIDTH_BYTE. (Mandatory)
          (+) TransferEventMode : DMA_TCEM_LAST_LL_ITEM_TRANSFER.
          (+) SrcSecure         : DMA_CHANNEL_SRC_SEC. (For trust zone devices)
          (+) DestSecure        : DMA_CHANNEL_DEST_SEC. (For trust zone devices)

    [..]
      Use ADV_LPBAM_I2C_MasterTx_SetFullQ() API to build a linked-list queue that setup the I2C master configuration and
      transmission starting operation according to parameters in the LPBAM_I2C_FullAdvConf_t structure.
      The data node default configuration is as follow:
          (+) SrcInc            : DMA_SINC_INCREMENTED.
          (+) DestInc           : DMA_DINC_FIXED. (Mandatory)
          (+) SrcDataWidth      : DMA_SRC_DATAWIDTH_BYTE.
          (+) DestDataWidth     : DMA_DEST_DATAWIDTH_BYTE. (Mandatory)
          (+) TransferEventMode : DMA_TCEM_LAST_LL_ITEM_TRANSFER.
          (+) SrcSecure         : DMA_CHANNEL_SRC_SEC. (For trust zone devices)
          (+) DestSecure        : DMA_CHANNEL_DEST_SEC. (For trust zone devices)

