STMicroelectronics/STM32CubeU5/Utilities/lpbam/stm32_adv_lpbam_i2c.c
    [..]
      Use ADV_LPBAM_I2C_SlaveTx_SetConfigQ() API to build a linked-list queue that setup the I2C slave configuration
      transmission operation according to parameters in the LPBAM_I2C_ConfigAdvConf_t structure.

    [..]
      Use ADV_LPBAM_I2C_SlaveTx_SetDataQ() API to build a linked-list queue that setup the I2C slave transmission
      starting operation according to parameters in the LPBAM_I2C_DataAdvConf_t structure.
      The data node default configuration is as follow:
          (+) SrcInc            : DMA_SINC_INCREMENTED.
          (+) DestInc           : DMA_DINC_FIXED. (Mandatory)
          (+) SrcDataWidth      : DMA_SRC_DATAWIDTH_BYTE.
          (+) DestDataWidth     : DMA_DEST_DATAWIDTH_BYTE. (Mandatory)
          (+) TransferEventMode : DMA_TCEM_LAST_LL_ITEM_TRANSFER.
          (+) SrcSecure         : DMA_CHANNEL_SRC_SEC. (For trust zone devices)
          (+) DestSecure        : DMA_CHANNEL_DEST_SEC. (For trust zone devices)

    [..]
      Use ADV_LPBAM_I2C_SlaveTx_SetFullQ() API to build a linked-list queue that setup the I2C slave configuration and
      transmission starting operation according to parameters in the LPBAM_I2C_FullAdvConf_t structure.
      The data node default configuration is as follow:
          (+) SrcInc            : DMA_SINC_INCREMENTED.
          (+) DestInc           : DMA_DINC_FIXED. (Mandatory)
          (+) SrcDataWidth      : DMA_SRC_DATAWIDTH_BYTE.
          (+) DestDataWidth     : DMA_DEST_DATAWIDTH_BYTE. (Mandatory)
          (+) TransferEventMode : DMA_TCEM_LAST_LL_ITEM_TRANSFER.
          (+) SrcSecure         : DMA_CHANNEL_SRC_SEC. (For trust zone devices)
          (+) DestSecure        : DMA_CHANNEL_DEST_SEC. (For trust zone devices)

    [..]
      Use ADV_LPBAM_I2C_MasterRx_SetConfigQ() API to build a linked-list queue that setup the I2C master configuration
      reception operation according to parameters in the LPBAM_I2C_ConfigAdvConf_t structure.

    [..]
      Use ADV_LPBAM_I2C_MasterRx_SetDataQ() API to build a linked-list queue that setup the I2C master reception
      starting operation according to parameters in the LPBAM_I2C_DataAdvConf_t structure.
      The data node default configuration is as follow:
          (+) SrcInc            : DMA_SINC_FIXED. (Mandatory)
          (+) DestInc           : DMA_DINC_INCREMENTED.
          (+) SrcDataWidth      : DMA_SRC_DATAWIDTH_BYTE. (Mandatory)
          (+) DestDataWidth     : DMA_DEST_DATAWIDTH_BYTE.
          (+) TransferEventMode : DMA_TCEM_LAST_LL_ITEM_TRANSFER.
          (+) SrcSecure         : DMA_CHANNEL_SRC_SEC. (For trust zone devices)
          (+) DestSecure        : DMA_CHANNEL_DEST_SEC. (For trust zone devices)

    [..]
      Use ADV_LPBAM_I2C_MasterRx_SetFullQ() API to build a linked-list queue that setup the I2C master configuration and
      reception starting operation according to parameters in the LPBAM_I2C_FullAdvConf_t structure.
      The data node default configuration is as follow:
          (+) SrcInc            : DMA_SINC_FIXED. (Mandatory)
          (+) DestInc           : DMA_DINC_INCREMENTED.
          (+) SrcDataWidth      : DMA_SRC_DATAWIDTH_BYTE. (Mandatory)
          (+) DestDataWidth     : DMA_DEST_DATAWIDTH_BYTE.
          (+) TransferEventMode : DMA_TCEM_LAST_LL_ITEM_TRANSFER.
          (+) SrcSecure         : DMA_CHANNEL_SRC_SEC. (For trust zone devices)
          (+) DestSecure        : DMA_CHANNEL_DEST_SEC. (For trust zone devices)

    [..]
      Use ADV_LPBAM_I2C_SlaveRx_SetConfigQ() API to build a linked-list queue that setup the I2C slave configuration
      reception operation according to parameters in the LPBAM_I2C_ConfigAdvConf_t structure.

    [..]
      Use ADV_LPBAM_I2C_SlaveRx_SetDataQ() API to build a linked-list queue that setup the I2C slave reception starting
      operation according to parameters in the LPBAM_I2C_DataAdvConf_t structure.
      The data node default configuration is as follow:
          (+) SrcInc            : DMA_SINC_FIXED. (Mandatory)
          (+) DestInc           : DMA_DINC_INCREMENTED.
          (+) SrcDataWidth      : DMA_SRC_DATAWIDTH_BYTE. (Mandatory)
          (+) DestDataWidth     : DMA_DEST_DATAWIDTH_BYTE.
          (+) TransferEventMode : DMA_TCEM_LAST_LL_ITEM_TRANSFER.
          (+) SrcSecure         : DMA_CHANNEL_SRC_SEC. (For trust zone devices)
          (+) DestSecure        : DMA_CHANNEL_DEST_SEC. (For trust zone devices)

    [..]
      Use ADV_LPBAM_I2C_SlaveRx_SetFullQ() API to build a linked-list queue that setup the I2C slave configuration and
      reception starting operation according to parameters in the LPBAM_I2C_FullAdvConf_t structure.
      The data node default configuration is as follow:
          (+) SrcInc            : DMA_SINC_FIXED. (Mandatory)
          (+) DestInc           : DMA_DINC_INCREMENTED.
          (+) SrcDataWidth      : DMA_SRC_DATAWIDTH_BYTE. (Mandatory)
          (+) DestDataWidth     : DMA_DEST_DATAWIDTH_BYTE.
          (+) TransferEventMode : DMA_TCEM_LAST_LL_ITEM_TRANSFER.
          (+) SrcSecure         : DMA_CHANNEL_SRC_SEC. (For trust zone devices)
          (+) DestSecure        : DMA_CHANNEL_DEST_SEC. (For trust zone devices)

    [..]
      Use ADV_LPBAM_I2C_MasterStopGeneration_SetFullQ() API to build a linked-list queue that setup the I2C master
      stop condition generating.

    [..]
      Configuration parameters through LPBAM_I2C_ConfigAdvConf_t are :
          (+) AutoModeConf : Specifies the autonomous mode parameters.
              (++) TriggerState     : Specifies the trigger state.
                                      This parameter can be a value of @ref LPBAM_I2CEx_AutonomousMode_FunctionalState.
              (++) TriggerSelection : Specifies the trigger state.
                                      This parameter can be a value of @ref LPBAM_I2CEx_AutonomousMode_TriggerSelection.
              (++) TriggerPolarity  : Specifies the trigger state.
                                      This parameter can be a value of @ref LPBAM_I2CEx_AutonomousMode_TriggerPolarity.
          (+) Timing       : Specifies the timing value.
                             This parameter calculated by referring to I2C initialization section in Reference manual.
          (+) WakeupIT     : Specifies the wake up source interrupt.
                             This parameter can be a value of @ref LPBAM_I2C_Wakeup_Interrupt.

