STMicroelectronics/STM32CubeU5/Utilities/lpbam/stm32_adv_lpbam_i2c.c
    [..]
      Configuration parameters through LPBAM_I2C_DataAdvConf_t are :
          (+) AutoModeConf   : Specifies the autonomous mode parameters.
              (++) TriggerState : Specifies the trigger state.
                                  This parameter can be a value of @ref LPBAM_I2CEx_AutonomousMode_FunctionalState.
          (+) AddressingMode : Specifies if 7-bit or 10-bit addressing mode is selected.
          (+) SequenceNumber : Specifies the number of frames to be transferred when sequential transfer is activated.
                               This parameter shall be equal to 1 when transfer is not sequential.
          (+) DevAddress     : Specifies the target device address.
          (+) Size           : Specifies the I2C data number of bytes to transfer.
          (+) pData          : Specifies the transfer buffer address.

    [..]
      Configuration parameters through LPBAM_I2C_FullAdvConf_t are :
          (+) AutoModeConf : Specifies the autonomous mode parameters.
              (++) TriggerState     : Specifies the trigger state.
                                      This parameter can be a value of @ref LPBAM_I2CEx_AutonomousMode_FunctionalState.
              (++) TriggerSelection : Specifies the trigger state.
                                      This parameter can be a value of @ref LPBAM_I2CEx_AutonomousMode_TriggerSelection.
              (++) TriggerPolarity  : Specifies the trigger state.
                                      This parameter can be a value of @ref LPBAM_I2CEx_AutonomousMode_TriggerPolarity.
          (+) Timing       : Specifies the timing value.
                             This parameter calculated by referring to I2C initialization section in Reference manual.
          (+) WakeupIT     : Specifies the wake up source interrupt.
                             This parameter can be a value of @ref LPBAM_I2C_Wakeup_Interrupt.
          (+) AddressingMode : Specifies if 7-bit or 10-bit addressing mode is selected.
          (+) SequenceNumber : Specifies the number of frames to be transferred when sequential transfer is activated.
                               This parameter shall be equal to 1 when transfer is not sequential.
          (+) DevAddress     : Specifies the target device address.
          (+) Size           : Specifies the I2C data number of bytes to transfer.
          (+) pData          : Specifies the transfer buffer address.

    [..]
      These APIs must be called when the I2C is well initialized.
          (+) Recommended I2C initialization sequence
              (++) call HAL_I2C_Init to initialize the I2C. (Mandatory)
                   Initialization parameters can be :
                   (+++) Timing                  : Any.
                   (+++) AddressingMode          : Any.
                   (+++) DualAddressMode         : I2C_DUALADDRESS_DISABLE.
                   (+++) OwnAddress2Masks        : I2C_OA2_NOMASK.
                   (+++) GeneralCallMode         : I2C_GENERALCALL_DISABLE.
                   (+++) NoStretchMode           : I2C_NOSTRETCH_DISABLE.
                   (+++) OwnAddress1             : Any.
                   (+++) OwnAddress2             : Any.
              (++) call HAL_I2CEx_SetConfigAutonomousMode to configure the autonomous mode.
                   (+++) TriggerState     : Any.
                   (+++) TriggerSelection : Any.
                   (+++) TriggerPolarity  : Any.
              (++) call HAL_I2CEx_EnableWakeUp to enable I2C wakeup from Stop mode(s).
              (++) Call __HAL_I2C_ENABLE_IT() to enable error interrupts.
                   I2C error interrupts can be :
                   (+++) I2C_IT_ERRI : Bus error / Arbitration lost error / Overrun/Underrun (slave mode) error.

    [..]
      The following parameters must be configured carefully as they are not configurable by LPBAM APIs :
          (+) DualAddressMode        : This parameter can be a value of @ref I2C_DUAL_ADDRESSING_MODE.
          (+) OwnAddress2Masks       : This parameter can be a value of @ref I2C_OWN_ADDRESS2_MASKS.
          (+) GeneralCallMode        : This parameter should be this value I2C_GENERAL_CALL_ADDRESSING_MODE.
          (+) NoStretchMode          : This parameter should be this value I2C_NOSTRETCH_MODE.
          (+) OwnAddress1            : Device first own address.
          (+) OwnAddress2            : Device second own address.

    *** Driver user sequence ***
    ============================
    [..]
      Generic driver user sequence (no sequential and no reload transfers) is :
          (+) Initialize the I2C (Using HAL/LL). (Mandatory)
          (+) Call ADV_LPBAM_I2C_EnableDMARequests() to enable the I2C DMA requests. (Mandatory)
          (+) There are two possibilities to call advanced API:
              (++) Transfer with full APIs :
                   (+++) For transmission mode, call ADV_LPBAM_I2C_[Mode]Tx_SetFullQ(). (Mandatory)
                   (+++) For reception mode, call ADV_LPBAM_I2C_[Mode]Rx_SetFullQ(). (Mandatory)
              (++) Transfer with configuration and data APIs :
                   (+++) For a transmission mode call ADV_LPBAM_I2C_[Mode]Tx_SetConfigQ() then
                         ADV_LPBAM_I2C_[Mode]Tx_SetDataQ(). (Mandatory)
                   (+++) For a reception mode call ADV_LPBAM_I2C_[Mode]Rx_SetConfigQ() then
                         ADV_LPBAM_I2C_[Mode]Rx_SetDataQ(). (Mandatory)
          (+) In master mode, call ADV_LPBAM_I2C_MasterStopGeneration_SetFullQ() to stop the current transfer and free
              the I2C bus when the transfer complete interrupt has been activated.

          (+) Call HAL_DMAEx_List_Init() to initialize a DMA channel in linked-list mode (Using HAL/LL). (Mandatory)
          (+) Call HAL_DMAEx_List_LinkQ() to link the output queue to the initialized DMA channel. (Mandatory)
          (+) Call __HAL_DMA_ENABLE_IT() to enable error interrupts.
              Any DMA error occurred in low power block the LPBAM sub-system mechanisms.
              DMA error interrupts can be :
              (++) DMA_IT_DTE : data transfer error.
              (++) DMA_IT_ULE : update link error.
              (++) DMA_IT_USE : user setting error.
          (+) Call HAL_DMAEx_List_Start() or HAL_DMAEx_List_Start_IT() to start DMA linked list. (Mandatory)

