STMicroelectronics/STM32CubeU5/Utilities/lpbam/stm32_adv_lpbam_i2c.c
    [..]
      Sequential transfers driver user sequence is (SequenceNumber > 1) :
          (+) Initialize the I2C (Using HAL/LL). (Mandatory)
          (+) Call ADV_LPBAM_I2C_EnableDMARequests() to enable the I2C DMA requests. (Mandatory)
          (+) There are two possibilities to call advanced API:
              (++) Transfer with full APIs :
                   (+++) For transmission mode, call ADV_LPBAM_I2C_[Mode]Tx_SetFullQ() x times where x = SequenceNumber.
                         (Mandatory)
                   (+++) For reception mode, call ADV_LPBAM_I2C_[Mode]Rx_SetFullQ() x times where x = SequenceNumber.
                         (Mandatory)
              (++) Transfer with configuration and data APIs :
                   (+++) For a transmission mode call ADV_LPBAM_I2C_[Mode]Tx_SetConfigQ() only one time then call
                         ADV_LPBAM_I2C_[Mode]Tx_SetDataQ() x times where x = SequenceNumber. (Mandatory).
                   (+++) For a reception mode call ADV_LPBAM_I2C_[Mode]Rx_SetConfigQ() only one time then call
                         ADV_LPBAM_I2C_[Mode]Rx_SetDataQ() x times where x = SequenceNumber. (Mandatory)
          (+) In master mode, call ADV_LPBAM_I2C_MasterStopGeneration_SetFullQ() to stop the current transfer and free
              the I2C bus when the transfer complete interrupt has been activated.
          (+) Call HAL_DMAEx_List_Init() to initialize a DMA channel in linked-list mode (Using HAL/LL). (Mandatory)
          (+) Call HAL_DMAEx_List_LinkQ() to link the output queue to the initialized DMA channel. (Mandatory)
          (+) Call __HAL_DMA_ENABLE_IT() to enable error interrupts.
              Any DMA error occurred in low power block the LPBAM sub-system mechanisms.
              DMA error interrupts can be :
              (++) DMA_IT_DTE : data transfer error.
              (++) DMA_IT_ULE : update link error.
              (++) DMA_IT_USE : user setting error.
          (+) Call HAL_DMAEx_List_Start() or HAL_DMAEx_List_Start_IT() to start DMA linked list. (Mandatory)

    [..]
      Reload transfers driver user sequence is (data size > 255) :
          (+) Initialize the I2C (Using HAL/LL). (Mandatory)
          (+) Call ADV_LPBAM_I2C_EnableDMARequests() to enable the I2C DMA requests. (Mandatory)
          (+) There are two possibilities to call advanced API:
              (++) Transfer with full APIs :
                   (+++) For transmission mode, call ADV_LPBAM_I2C_[Mode]Tx_SetFullQ() y time where y is the integer
                         part of ((Size)/255) + 1. (Mandatory)
                   (+++) For reception mode, call ADV_LPBAM_I2C_[Mode]Rx_SetFullQ() y times where y is the integer part
                         of ((Size)/255) + 1. (Mandatory)
              (++) Transfer with configuration and data APIs :
                   (+++) For a transmission mode call ADV_LPBAM_I2C_[Mode]Tx_SetConfigQ() only one time then call
                         ADV_LPBAM_I2C_[Mode]Tx_SetDataQ() y times where y is the integer part of ((Size)/255) + 1.
                         (Mandatory)
                   (+++) For a reception mode call ADV_LPBAM_I2C_[Mode]Rx_SetConfigQ() only one time then call
                         ADV_LPBAM_I2C_[Mode]Rx_SetDataQ() y times where y is the integer part of ((Size)/255) + 1.
                         (Mandatory)
          (+) In master mode, call ADV_LPBAM_I2C_MasterStopGeneration_SetFullQ() to stop the current transfer and free
              the I2C bus when the transfer complete interrupt has been activated.
          (+) Call HAL_DMAEx_List_Init() to initialize a DMA channel in linked-list mode (Using HAL/LL). (Mandatory)
          (+) Call HAL_DMAEx_List_LinkQ() to link the output queue to the initialized DMA channel. (Mandatory)
          (+) Call __HAL_DMA_ENABLE_IT() to enable error interrupts.
              Any DMA error occurred in low power block the LPBAM sub-system mechanisms.
              DMA error interrupts can be :
              (++) DMA_IT_DTE : data transfer error.
              (++) DMA_IT_ULE : update link error.
              (++) DMA_IT_USE : user setting error.
          (+) Call HAL_DMAEx_List_Start() or HAL_DMAEx_List_Start_IT() to start DMA linked list. (Mandatory)

    [..]
      Reload and sequential transfers driver user sequence is (SequenceNumber > 1 && data size > 255):
          (+) Initialize the I2C (Using HAL/LL). (Mandatory)
          (+) Enable I2C to wakeup CPU from Stop mode(s) (Using HAL/LL). (Optional)
          (+) Enable I2C errors interrupt. (Optional)
          (+) Call ADV_LPBAM_I2C_EnableDMARequests() to enable the I2C DMA requests. (Mandatory)
          (+) There are two possibilities to call advanced API:
              (++) Transfer with full APIs :
                   (+++) For transmission mode, call ADV_LPBAM_I2C_[Mode]Tx_SetFullQ() x times where x = SequenceNumber.
                         Each sequence with data size > 255 should be called y times where y is the integer part of
                         ((Size)/255) + 1. (Mandatory)
                   (+++) For reception mode, call ADV_LPBAM_I2C_[Mode]Rx_SetFullQ() x times where x = SequenceNumber.
                         Each sequence with data size > 255 should be called y times where y is the integer part of
                         ((Size)/255) + 1. (Mandatory)
              (++) Transfer with configuration and data APIs :
                   (+++) For a transmission mode call ADV_LPBAM_I2C_[Mode]Tx_SetConfigQ() only one time then call
                         ADV_LPBAM_I2C_[Mode]Tx_SetDataQ() x times where x = SequenceNumber. Each data sequence with
                         data size > 255 should be called y times where y is the integer part of ((Size)/255) + 1.
                         (Mandatory)
                   (+++) For a reception mode call ADV_LPBAM_I2C_[Mode]Rx_SetConfigQ() only one time then call
                         ADV_LPBAM_I2C_[Mode]Rx_SetDataQ() x times where x = SequenceNumber. Each data sequence with
                         data size > 255 should be called y times where y is the integer part of ((Size)/255) + 1.
                         (Mandatory)
          (+) In master mode, call ADV_LPBAM_I2C_MasterStopGeneration_SetFullQ() to stop the current transfer and free
              the I2C bus when the transfer complete interrupt has been activated.
          (+) Call HAL_DMAEx_List_Init() to initialize a DMA channel in linked-list mode (Using HAL/LL). (Mandatory)
          (+) Call HAL_DMAEx_List_LinkQ() to link the output queue to the initialized DMA channel. (Mandatory)
          (+) Call __HAL_DMA_ENABLE_IT() to enable error interrupts.
              Any DMA error occurred in low power block the LPBAM sub-system mechanisms.
              DMA error interrupts can be :
              (++) DMA_IT_DTE : data transfer error.
              (++) DMA_IT_ULE : update link error.
              (++) DMA_IT_USE : user setting error.
          (+) Call HAL_DMAEx_List_Start() or HAL_DMAEx_List_Start_IT() to start DMA linked list. (Mandatory)

    *** Recommendation ***
    ======================
    [..]
      It's mandatory to set properly DataSize, TriggerState, TriggerSelection and TriggerPolarity while configuring
      LPBAM_I2C_ConfigAdvConf_t or LPBAM_SPI_FullAdvConf_t because their update can be only done with
      ADV_LPBAM_I2C_{Operation}_SetConfigQ() or ADV_LPBAM_I2C_{Operation}_SetFullQ().

