STMicroelectronics/STM32CubeU5/Utilities/lpbam/stm32_adv_lpbam_i2c.c
    [..]
      It's strongly not allowed to repeat calling ADV_LPBAM_I2C_(Master/Slave)(Tx/Rx)_SetConfigQ() before starting the
      LPBAM scenario as it deactivates then activates the I2C.

    [..]
      It's strongly not recommended to use full APIs in a sequential transaction for better memory optimisation usage.

    [..]
      It's strongly not recommended to execute the same linked-list queue that contains I2C configuration and data
      nodes by two different DMA channels as unexpected behavior can appear.

    [..]
      It's strongly not recommended to call advanced I2C APIs by more than one linked-list queue. When the I2C nodes
      will be executed simultaneously an unexpected behavior will appear.

    *** Driver status description ***
    =================================
    [..]
      This driver detects and reports any detected issue.
          (+) returned values are :
              (++) LPBAM_OK when no error is detected.
              (++) LPBAM_ERROR when error is detected.
              (++) LPBAM_INVALID_ID when an invalid node ID is detected. This error value is specific for LPBAM basic
                   layer.

  @endverbatim
  **********************************************************************************************************************
  */

/* Includes ----------------------------------------------------------------------------------------------------------*/
#include "stm32_lpbam.h"

#ifdef LPBAM_I2C_MODULE_ENABLED

/* Private typedef ---------------------------------------------------------------------------------------------------*/
/* Private define ----------------------------------------------------------------------------------------------------*/

/** @addtogroup LPBAM_Utilities_Driver
  * @{
  */

/** @defgroup I2C_Advanced I2C_Advanced
  * @brief    I2C Advanced LPBAM module driver
  * @{
  */

/* Private variables -------------------------------------------------------------------------------------------------*/
/** @defgroup LPBAM_I2C_Advanced_Private_Variables LPBAM I2C Advanced Private Variables
  * @{
  */

/* Store sequential number */
static uint32_t SequentialIdx = 1U;

/**
  * @}
  */

/* Private macro -----------------------------------------------------------------------------------------------------*/
/* Private function prototypes ---------------------------------------------------------------------------------------*/
/* Exported functions ------------------------------------------------------------------------------------------------*/
/** @defgroup LPBAM_I2C_Advanced_Exported_Functions LPBAM I2C Advanced Exported Functions
  * @{
  */

/**
  * @brief  Build the I2C master transmit configuration nodes in DMA linked-list queue according to configured
  *         parameters in LPBAM_I2C_ConfigAdvConf_t.
  * @param  pInstance    : [IN]  Pointer to a I2C_TypeDef structure that selects I2C instance.
  * @param  pDMAListInfo : [IN]  Pointer to a LPBAM_DMAListInfo_t structure that contains DMA instance and linked-list
  *                              queue type information.
  * @param  pTxConfig    : [IN]  Pointer to a LPBAM_I2C_ConfigAdvConf_t structure that contains master transmit
  *                              configuration nodes information.
  * @param  pDescriptor  : [IN]  Pointer to a LPBAM_I2C_MasterTxConfigDesc_t structure that contains transmit
  *                              configuration descriptor information.
  * @param  pQueue       : [OUT] Pointer to a DMA_QListTypeDef structure that contains DMA linked-list queue
  *                              information.
  * @retval LPBAM Status : [OUT] Value from LPBAM_Status_t enumeration.
  */
LPBAM_Status_t ADV_LPBAM_I2C_MasterTx_SetConfigQ(I2C_TypeDef                    *const pInstance,
                                                 LPBAM_DMAListInfo_t            const *const pDMAListInfo,
                                                 LPBAM_I2C_ConfigAdvConf_t      const *const pTxConfig,
                                                 LPBAM_I2C_MasterTxConfigDesc_t *const pDescriptor,
                                                 DMA_QListTypeDef               *const pQueue)
{
  LPBAM_I2C_ConfNode_t config_node;
  DMA_NodeConfTypeDef  dma_node_conf;
  uint8_t idx = 0U;

  /*
   *               ######## Disable I2C Instance ########
   */

  /* Set I2C instance */
  config_node.pInstance                   = pInstance;

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID    = (uint32_t)LPBAM_I2C_STATE_ID;
  config_node.NodeDesc.NodeInfo.NodeType  = pDMAListInfo->QueueType;
  config_node.NodeDesc.pSrcVarReg         = &pDescriptor->pReg[idx];

  /* Set specific parameters for node creation */
  config_node.Config.Mode                 = LPBAM_I2C_MASTER_TRANSMIT_MODE;
  config_node.Config.State                = DISABLE;

  /* Fill descriptor for lpbam configuration transaction */
  if (LPBAM_I2C_FillNodeConfig(&config_node, &dma_node_conf) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build disable node */
  if (HAL_DMAEx_List_BuildNode(&dma_node_conf, &pDescriptor->pNodes[idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert disable node to I2C Queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Update node index */
  idx++;


  /*
   *               ######## Set I2C Timing ########
   */
  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID = (uint32_t)LPBAM_I2C_TIMING_ID;
  config_node.NodeDesc.pSrcVarReg      = &pDescriptor->pReg[idx];

  /* Set specific parameters for node creation */
  config_node.Config.Timing            = pTxConfig->Timing;

  /* Fill descriptor for lpbam configuration transaction */
  if (LPBAM_I2C_FillNodeConfig(&config_node, &dma_node_conf) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build timing node */
  if (HAL_DMAEx_List_BuildNode(&dma_node_conf, &pDescriptor->pNodes[idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert timing node to I2C Queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Update node index */
  idx++;


