STMicroelectronics/STM32CubeU5/Utilities/lpbam/stm32_adv_lpbam_i2c.c
  /*
   *               ######## Select I2C Trigger Source ########
   */

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID             = (uint32_t)LPBAM_I2C_TRIG_ID;
  config_node.NodeDesc.pSrcVarReg                  = &pDescriptor->pReg[idx];

  /* Set specific parameters for node creation */
  config_node.Config.AutoModeConf.TriggerState     = pTxConfig->AutoModeConf.TriggerState;
  config_node.Config.AutoModeConf.TriggerSelection = pTxConfig->AutoModeConf.TriggerSelection;
  config_node.Config.AutoModeConf.TriggerPolarity  = pTxConfig->AutoModeConf.TriggerPolarity;

  /* Fill descriptor for lpbam configuration transaction */
  if (LPBAM_I2C_FillNodeConfig(&config_node, &dma_node_conf) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build trigger source node */
  if (HAL_DMAEx_List_BuildNode(&dma_node_conf, &pDescriptor->pNodes[idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert trigger source node to I2C Queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }
  /* Update node index */
  idx++;


  /*
   *               ######## Enable I2C Instance ########
   */

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID = (uint32_t)LPBAM_I2C_STATE_ID;
  config_node.NodeDesc.pSrcVarReg      = &pDescriptor->pReg[idx];

  /* Set specific parameters for node creation */
  config_node.Config.State             = ENABLE;
  config_node.Config.WakeupIT          = pTxConfig->WakeupIT;

  /* Fill descriptor for lpbam configuration transaction */
  if (LPBAM_I2C_FillNodeConfig(&config_node, &dma_node_conf) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build enable node */
  if (HAL_DMAEx_List_BuildNode(&dma_node_conf, &pDescriptor->pNodes[idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert enable node to I2C Queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  return LPBAM_OK;
}

/**
  * @brief  Build the I2C master transmit data nodes in DMA linked-list queue according to configured parameters in
  *         LPBAM_I2C_DataAdvConf_t.
  * @param  pInstance    : [IN]  Pointer to a I2C_TypeDef structure that selects I2C instance.
  * @param  pDMAListInfo : [IN]  Pointer to a LPBAM_DMAListInfo_t structure that contains DMA instance and linked-list
  *                              queue type information.
  * @param  pTxData      : [IN]  Pointer to a LPBAM_I2C_DataAdvConf_t structure that contains transmit data nodes
  *                              information.
  * @param  pDescriptor  : [IN]  Pointer to a LPBAM_I2C_MasterTxDataDesc_t structure that contains transmit data
  *                              descriptor information.
  * @param  pQueue       : [OUT] Pointer to a DMA_QListTypeDef structure that contains DMA linked-list queue
  *                              information.
  * @retval LPBAM Status : [OUT] Value from LPBAM_Status_t enumeration.
  */
LPBAM_Status_t ADV_LPBAM_I2C_MasterTx_SetDataQ(I2C_TypeDef                  *const pInstance,
                                               LPBAM_DMAListInfo_t          const *const pDMAListInfo,
                                               LPBAM_I2C_DataAdvConf_t      const *const pTxData,
                                               LPBAM_I2C_MasterTxDataDesc_t *const pDescriptor,
                                               DMA_QListTypeDef             *const pQueue)
{
  LPBAM_I2C_ConfNode_t config_node;
  DMA_NodeConfTypeDef  dma_node_conf;
  static uint8_t is_reload_data = 0U;
  static uint32_t buffer_offset = 0U;
  uint8_t idx                   = 0U;
  uint32_t buffer_address;

  /*
   *               ######## Setup reload data variables ########
   */

  /* Check if data size > Max I2C data size */
  if (pTxData->Size > LPBAM_I2C_MAX_DATA_SIZE)
  {
    /* Update reload data information */
    config_node.Config.ReloadDataState  = ENABLE;
    config_node.Config.IsLastReloadData = LPBAM_I2C_IS_NOT_LAST_RELOADED_DATA;

    if (is_reload_data == 1U)
    {
      /* Update reload data information */
      config_node.Config.IsFirstReloadData = LPBAM_I2C_IS_NOT_FIRST_RELOADED_DATA;
    }
    else
    {
      /* Update reload data information */
      config_node.Config.IsFirstReloadData = LPBAM_I2C_IS_FIRST_RELOADED_DATA;

      /* Update reload variable */
      is_reload_data = 1U;
    }
  }
  /* Data size < 255 */
  else
  {
    /* Transfer data is reloaded  */
    if (is_reload_data == 1U)
    {
      /* Enable reload data */
      config_node.Config.ReloadDataState   = ENABLE;

      /* Update reload data information */
      config_node.Config.IsFirstReloadData = LPBAM_I2C_IS_NOT_FIRST_RELOADED_DATA;
      config_node.Config.IsLastReloadData  = LPBAM_I2C_IS_LAST_RELOADED_DATA;

      /* Reset reload data variable */
      is_reload_data = 0U;
    }
    /* Transfer data is not reloaded  */
    else
    {
      /* Disable reload data */
      config_node.Config.ReloadDataState = DISABLE;
    }
  }


  /*
   *               ######## Setup sequential data variables ########
   */

  /* Transfer data is sequential */
  if (pTxData->SequenceNumber > 1U)
  {
    /* Enable sequential data transfer */
    config_node.Config.SequentialDataState = ENABLE;

    /* First sequential data transfer */
    if (SequentialIdx == 1U)
    {
      /* Update sequential data information */
      config_node.Config.IsFirstSequentialData = LPBAM_I2C_IS_FIRST_SEQUENTIAL_DATA;
      config_node.Config.IsLastSequentialData  = LPBAM_I2C_IS_NOT_LAST_SEQUENTIAL_DATA;
      /* Update sequential variable */
      SequentialIdx++;
    }
    /* Last sequential data transfer */
    else if ((SequentialIdx == pTxData->SequenceNumber) && (is_reload_data == 0U))
    {
      /* Update sequential data information */
      config_node.Config.IsFirstSequentialData = LPBAM_I2C_IS_NOT_FIRST_SEQUENTIAL_DATA;
      config_node.Config.IsLastSequentialData  = LPBAM_I2C_IS_LAST_SEQUENTIAL_DATA;
      /* Update sequential variable */
      SequentialIdx = 1U;
    }
    else
    {
      /* Update sequential data information */
      config_node.Config.IsFirstSequentialData = LPBAM_I2C_IS_NOT_FIRST_SEQUENTIAL_DATA;
      config_node.Config.IsLastSequentialData  = LPBAM_I2C_IS_NOT_LAST_SEQUENTIAL_DATA;

      /* Check if reload data is disabled */
      if (is_reload_data == 0U)
      {
        /* Update sequential variable */
        SequentialIdx++;
      }
    }
  }
  /* Transfer data is not sequential */
  else
  {
    /* Disable sequential data */
    config_node.Config.SequentialDataState = DISABLE;
  }


