STMicroelectronics/STM32CubeU5/Utilities/lpbam/stm32_adv_lpbam_i2c.c
  /* Check reload and sequential information */
  if (((config_node.Config.ReloadDataState == DISABLE) && (config_node.Config.SequentialDataState == DISABLE)) || \
      ((config_node.Config.SequentialDataState == ENABLE)                                                      && \
       (config_node.Config.IsFirstSequentialData == LPBAM_I2C_IS_FIRST_SEQUENTIAL_DATA))                       || \
      ((config_node.Config.SequentialDataState == DISABLE)                                                     && \
       (config_node.Config.IsFirstReloadData == LPBAM_I2C_IS_FIRST_RELOADED_DATA)))
  {
    /*
     *               ######## Disable I2C Instance ########
     */

    /* Set I2C instance */
    config_node.pInstance                  = pInstance;

    /* Set node descriptor */
    config_node.NodeDesc.NodeInfo.NodeID   = (uint32_t)LPBAM_I2C_STATE_ID;
    config_node.NodeDesc.NodeInfo.NodeType = pDMAListInfo->QueueType;
    config_node.NodeDesc.pSrcVarReg        = &pDescriptor->pReg[idx];

    /* Set specific parameters for node creation */
    config_node.Config.Mode                = LPBAM_I2C_MASTER_TRANSMIT_MODE;
    config_node.Config.State               = DISABLE ;

    /* Fill descriptor for lpbam configuration transaction */
    if (LPBAM_I2C_FillNodeConfig(&config_node, &dma_node_conf) != LPBAM_OK)
    {
      return LPBAM_ERROR;
    }

    /* Build disable node */
    if (HAL_DMAEx_List_BuildNode(&dma_node_conf, &pDescriptor->pNodes[idx]) != HAL_OK)
    {
      return LPBAM_ERROR;
    }

    /* Insert disable node to I2C Queue */
    if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[idx]) != HAL_OK)
    {
      return LPBAM_ERROR;
    }

    /* Update node index */
    idx++;


    /*
     *               ######## Set I2C Timing ########
     */

    /* Set node descriptor */
    config_node.NodeDesc.NodeInfo.NodeID = (uint32_t)LPBAM_I2C_TIMING_ID;
    config_node.NodeDesc.pSrcVarReg      = &pDescriptor->pReg[idx];

    /* Set specific parameters for node creation */
    config_node.Config.Timing            = pTxFull->Timing;

    /* Fill descriptor for lpbam configuration transaction */
    if (LPBAM_I2C_FillNodeConfig(&config_node, &dma_node_conf) != LPBAM_OK)
    {
      return LPBAM_ERROR;
    }

    /* Build timing node */
    if (HAL_DMAEx_List_BuildNode(&dma_node_conf, &pDescriptor->pNodes[idx]) != HAL_OK)
    {
      return LPBAM_ERROR;
    }

    /* Insert timing node to I2C Queue */
    if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[idx]) != HAL_OK)
    {
      return LPBAM_ERROR;
    }

    /* Update node index */
    idx++;


    /*
     *               ######## Select I2C Trigger Source ########
     */

    /* Set node descriptor */
    config_node.NodeDesc.NodeInfo.NodeID             = (uint32_t)LPBAM_I2C_TRIG_ID;
    config_node.NodeDesc.pSrcVarReg                  = &pDescriptor->pReg[idx];

    /* Set specific parameters for node creation */
    config_node.Config.AutoModeConf.TriggerState     = pTxFull->AutoModeConf.TriggerState;
    config_node.Config.AutoModeConf.TriggerSelection = pTxFull->AutoModeConf.TriggerSelection;
    config_node.Config.AutoModeConf.TriggerPolarity  = pTxFull->AutoModeConf.TriggerPolarity;

    /* Fill descriptor for lpbam configuration transaction */
    if (LPBAM_I2C_FillNodeConfig(&config_node, &dma_node_conf) != LPBAM_OK)
    {
      return LPBAM_ERROR;
    }

    /* Build trigger source node */
    if (HAL_DMAEx_List_BuildNode(&dma_node_conf, &pDescriptor->pNodes[idx]) != HAL_OK)
    {
      return LPBAM_ERROR;
    }

    /* Insert trigger source node to I2C Queue */
    if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[idx]) != HAL_OK)
    {
      return LPBAM_ERROR;
    }

    /* Update node index */
    idx++;


    /*
     *               ######## Enable I2C Instance ########
     */

    /* Set node descriptor */
    config_node.NodeDesc.NodeInfo.NodeID = (uint32_t)LPBAM_I2C_STATE_ID;
    config_node.NodeDesc.pSrcVarReg      = &pDescriptor->pReg[idx];

    /* Set specific parameters for node creation */
    config_node.Config.State             = ENABLE;
    config_node.Config.WakeupIT          = pTxFull->WakeupIT;

    /* Fill descriptor for lpbam configuration transaction */
    if (LPBAM_I2C_FillNodeConfig(&config_node, &dma_node_conf) != LPBAM_OK)
    {
      return LPBAM_ERROR;
    }

    /* Build enable node */
    if (HAL_DMAEx_List_BuildNode(&dma_node_conf, &pDescriptor->pNodes[idx]) != HAL_OK)
    {
      return LPBAM_ERROR;
    }

    /* Insert enable node to I2C Queue */
    if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[idx]) != HAL_OK)
    {
      return LPBAM_ERROR;
    }

    /* Update node index */
    idx++;
  }
  else
  {
    /* Update node index */
    idx = I2C_MASTER_DATA_NODEIDX;
  }


  /*
   *               ######## Configure I2C transfer  ########
   */

  /* Set I2C instance */
  config_node.pInstance                  = pInstance;

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID   = (uint32_t)LPBAM_I2C_CONFIG_TRANSACTION_ID;
  config_node.NodeDesc.NodeInfo.NodeType = pDMAListInfo->QueueType;
  config_node.NodeDesc.pSrcVarReg        = &pDescriptor->pReg[idx];

  /* Set specific parameters for node creation */
  config_node.Config.Mode                = LPBAM_I2C_MASTER_TRANSMIT_MODE;
  config_node.Config.DevAddress          = pTxFull->DevAddress;
  config_node.Config.Size                = pTxFull->Size;
  config_node.Config.AddressingMode      = pTxFull->AddressingMode;
  config_node.Config.StopConditionState  = DISABLE;

  /* Fill configuration node */
  if (LPBAM_I2C_FillNodeConfig(&config_node, &dma_node_conf) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build configuration node */
  if (HAL_DMAEx_List_BuildNode(&dma_node_conf, &pDescriptor->pNodes[idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert configuration node to I2C Queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Update node index */
  idx++;


