STMicroelectronics/STM32CubeU5/Utilities/lpbam/stm32_adv_lpbam_i2c.c
  /*
   *               ######## I2C Transmit Data  ########
   */

  /* Get data buffer address */
  buffer_address                       = (uint32_t)&pTxFull->pData[buffer_offset];

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID = (uint32_t)LPBAM_I2C_TRANSMIT_DATA_ID;
  config_node.NodeDesc.pBuff           = (uint32_t *)buffer_address;

  /* Fill node configuration */
  if (LPBAM_I2C_FillNodeConfig(&config_node, &dma_node_conf) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build transmit data node */
  if (HAL_DMAEx_List_BuildNode(&dma_node_conf, &pDescriptor->pNodes[idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert transmit data to I2C Queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Reload data transfer */
  if (is_reload_data == 1U)
  {
    buffer_offset += LPBAM_I2C_MAX_DATA_SIZE;
  }
  /* Reload data transfer */
  else
  {
    /* Reset buffer offset variable */
    buffer_offset = 0U;
  }

  return LPBAM_OK;
}

/**
  * @brief  Build the I2C slave transmit configuration nodes in DMA linked-list queue according to configured parameters
  *         in LPBAM_I2C_ConfigAdvConf_t.
  * @param  pInstance    : [IN]  Pointer to a I2C_TypeDef structure that selects I2C instance.
  * @param  pDMAListInfo : [IN]  Pointer to a LPBAM_DMAListInfo_t structure that contains DMA instance and linked-list
  *                              queue type information.
  * @param  pTxConfig    : [IN]  Pointer to a LPBAM_I2C_ConfigAdvConf_t structure that contains transmit configuration
  *                              nodes information.
  * @param  pDescriptor  : [IN]  Pointer to a LPBAM_I2C_SlaveTxConfigDesc_t structure that contains transmit
  *                              configuration descriptor information.
  * @param  pQueue       : [OUT] Pointer to a DMA_QListTypeDef structure that contains DMA linked-list queue
  *                              information.
  * @retval LPBAM Status : [OUT] Value from LPBAM_Status_t enumeration.
  */
LPBAM_Status_t ADV_LPBAM_I2C_SlaveTx_SetConfigQ(I2C_TypeDef                   *const pInstance,
                                                LPBAM_DMAListInfo_t           const *const pDMAListInfo,
                                                LPBAM_I2C_ConfigAdvConf_t     const *const pTxConfig,
                                                LPBAM_I2C_SlaveTxConfigDesc_t *const pDescriptor,
                                                DMA_QListTypeDef              *const pQueue)
{
  LPBAM_I2C_ConfNode_t config_node;
  DMA_NodeConfTypeDef  dma_node_conf;
  uint8_t idx = 0U;

  /*
   *               ######## Disable I2C Instance ########
   */

  /* Set I2C instance */
  config_node.pInstance                  = pInstance;

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID   = (uint32_t)LPBAM_I2C_STATE_ID;
  config_node.NodeDesc.NodeInfo.NodeType = pDMAListInfo->QueueType;
  config_node.NodeDesc.pSrcVarReg        = &pDescriptor->pReg[idx];

  /* Set specific parameters for node creation */
  config_node.Config.Mode                = LPBAM_I2C_SLAVE_TRANSMIT_MODE;
  config_node.Config.State               = DISABLE ;

  /* Fill descriptor for lpbam configuration transaction */
  if (LPBAM_I2C_FillNodeConfig(&config_node, &dma_node_conf) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build disable node */
  if (HAL_DMAEx_List_BuildNode(&dma_node_conf, &pDescriptor->pNodes[idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert disable node to I2C Queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Update node index */
  idx++;


  /*
   *               ######## Set I2C Timing ########
   */
  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID = (uint32_t)LPBAM_I2C_TIMING_ID;
  config_node.NodeDesc.pSrcVarReg      = &pDescriptor->pReg[idx];

  /* Set specific parameters for node creation */
  config_node.Config.Timing            = pTxConfig->Timing;

  /* Fill descriptor for lpbam configuration transaction */
  if (LPBAM_I2C_FillNodeConfig(&config_node, &dma_node_conf) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build timing node */
  if (HAL_DMAEx_List_BuildNode(&dma_node_conf, &pDescriptor->pNodes[idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert timing node to I2C Queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Update node index */
  idx++;


  /*
   *               ######## Enable I2C Instance ########
   */

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID = (uint32_t)LPBAM_I2C_STATE_ID;
  config_node.NodeDesc.pSrcVarReg      = &pDescriptor->pReg[idx];

  /* Set specific parameters for node creation */
  config_node.Config.State             = ENABLE ;
  config_node.Config.WakeupIT          = pTxConfig->WakeupIT;

  /* Fill descriptor for lpbam configuration transaction */
  if (LPBAM_I2C_FillNodeConfig(&config_node, &dma_node_conf) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build enable node */
  if (HAL_DMAEx_List_BuildNode(&dma_node_conf, &pDescriptor->pNodes[idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert enable node to I2C Queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  return LPBAM_OK;
}

/**
  * @brief  Build the I2C slave transmit data nodes in DMA linked-list queue according to configured parameters in
  *         LPBAM_I2C_DataAdvConf_t.
  * @param  pInstance    : [IN]  Pointer to a I2C_TypeDef structure that selects I2C instance.
  * @param  pDMAListInfo : [IN]  Pointer to a LPBAM_DMAListInfo_t structure that contains DMA instance and linked-list
  *                              queue type information.
  * @param  pTxData      : [IN]  Pointer to a LPBAM_I2C_DataAdvConf_t structure that contains transmit data nodes
  *                              information.
  * @param  pDescriptor  : [IN]  Pointer to a LPBAM_I2C_SlaveTxDataDesc_t structure that contains transmit data
  *                              descriptor information.
  * @param  pQueue       : [OUT] Pointer to a DMA_QListTypeDef structure that contains DMA linked-list queue
  *                              information.
  * @retval LPBAM Status : [OUT] Value from LPBAM_Status_t enumeration.
  */
LPBAM_Status_t ADV_LPBAM_I2C_SlaveTx_SetDataQ(I2C_TypeDef                 *const pInstance,
                                              LPBAM_DMAListInfo_t         const *const pDMAListInfo,
                                              LPBAM_I2C_DataAdvConf_t     const *const pTxData,
                                              LPBAM_I2C_SlaveTxDataDesc_t *const pDescriptor,
                                              DMA_QListTypeDef            *const pQueue)
{
  LPBAM_I2C_ConfNode_t config_node;
  DMA_NodeConfTypeDef  dma_node_conf;
  static uint8_t is_reload_data = 0U;
  static uint32_t buffer_offset = 0U;
  uint8_t idx                   = 0U;
  uint32_t buffer_address;

