STMicroelectronics/STM32CubeU5/Utilities/lpbam/stm32_adv_lpbam_i2c.c
  /*
   *               ######## Setup reload data variables ########
   */

  /* Check if data size > Max I2C data size */
  if (pTxFull->Size > LPBAM_I2C_MAX_DATA_SIZE)
  {
    /* Update reload data information */
    config_node.Config.ReloadDataState  = ENABLE;
    config_node.Config.IsLastReloadData = LPBAM_I2C_IS_NOT_LAST_RELOADED_DATA;

    if (is_reload_data == 1U)
    {
      /* Update reload data information */
      config_node.Config.IsFirstReloadData = LPBAM_I2C_IS_NOT_FIRST_RELOADED_DATA;
    }
    else
    {
      /* Update reload data information */
      config_node.Config.IsFirstReloadData = LPBAM_I2C_IS_FIRST_RELOADED_DATA;

      /* Update reload variable */
      is_reload_data = 1U;
    }
  }
  /* Data size < 255 */
  else
  {
    /* Transfer data is reloaded  */
    if (is_reload_data == 1U)
    {
      /* Enable reload data */
      config_node.Config.ReloadDataState = ENABLE;

      /* Update reload data information */
      config_node.Config.IsFirstReloadData = LPBAM_I2C_IS_NOT_FIRST_RELOADED_DATA;
      config_node.Config.IsLastReloadData  = LPBAM_I2C_IS_LAST_RELOADED_DATA;

      /* Reset reload data variable */
      is_reload_data = 0U;
    }
    /* Transfer data is not reloaded  */
    else
    {
      /* Disable reload data */
      config_node.Config.ReloadDataState = DISABLE;
    }
  }


  /*
   *               ######## Setup sequential data variables ########
   */

  /* Transfer data is sequential */
  if (pTxFull->SequenceNumber > 1U)
  {
    /* Enable sequential data transfer */
    config_node.Config.SequentialDataState = ENABLE;

    /* First sequential data transfer */
    if (SequentialIdx == 1U)
    {
      /* Update sequential data information */
      config_node.Config.IsFirstSequentialData = LPBAM_I2C_IS_FIRST_SEQUENTIAL_DATA;
      config_node.Config.IsLastSequentialData  = LPBAM_I2C_IS_NOT_LAST_SEQUENTIAL_DATA;
      /* Update sequential variable */
      SequentialIdx++;
    }
    /* Last sequential data transfer */
    else if ((SequentialIdx == pTxFull->SequenceNumber) && (is_reload_data == 0U))
    {
      /* Update sequential data information */
      config_node.Config.IsFirstSequentialData = LPBAM_I2C_IS_NOT_FIRST_SEQUENTIAL_DATA;
      config_node.Config.IsLastSequentialData  = LPBAM_I2C_IS_LAST_SEQUENTIAL_DATA;
      /* Update sequential variable */
      SequentialIdx = 1U;
    }
    else
    {
      /* Update sequential data information */
      config_node.Config.IsFirstSequentialData = LPBAM_I2C_IS_NOT_FIRST_SEQUENTIAL_DATA;
      config_node.Config.IsLastSequentialData  = LPBAM_I2C_IS_NOT_LAST_SEQUENTIAL_DATA;

      /* Check if reload data is disabled */
      if (is_reload_data == 0U)
      {
        /* Update sequential variable */
        SequentialIdx++;
      }
    }
  }
  /* Transfer data is not sequential */
  else
  {
    /* Disable sequential data */
    config_node.Config.SequentialDataState = DISABLE;
  }

  /* Check reload and sequential information */
  if (((config_node.Config.ReloadDataState == DISABLE) && (config_node.Config.SequentialDataState == DISABLE)) || \
      ((config_node.Config.SequentialDataState == ENABLE)                                                      && \
       (config_node.Config.IsFirstSequentialData == LPBAM_I2C_IS_FIRST_SEQUENTIAL_DATA))                       || \
      ((config_node.Config.SequentialDataState == DISABLE)                                                     && \
       (config_node.Config.IsFirstReloadData == LPBAM_I2C_IS_FIRST_RELOADED_DATA)))
  {
    /*
     *               ######## Disable I2C Instance ########
     */

    /* Set I2C instance */
    config_node.pInstance                  = pInstance;
    /* Set node descriptor */
    config_node.NodeDesc.NodeInfo.NodeID   = (uint32_t)LPBAM_I2C_STATE_ID;
    config_node.NodeDesc.NodeInfo.NodeType = pDMAListInfo->QueueType;
    config_node.NodeDesc.pSrcVarReg        = &pDescriptor->pReg[idx];

    /* Set specific parameters for node creation */
    config_node.Config.Mode                = LPBAM_I2C_SLAVE_TRANSMIT_MODE;
    config_node.Config.State               = DISABLE ;

    /* Fill descriptor for lpbam configuration transaction */
    if (LPBAM_I2C_FillNodeConfig(&config_node, &dma_node_conf) != LPBAM_OK)
    {
      return LPBAM_ERROR;
    }

    /* Build disable node */
    if (HAL_DMAEx_List_BuildNode(&dma_node_conf, &pDescriptor->pNodes[idx]) != HAL_OK)
    {
      return LPBAM_ERROR;
    }

    /* Insert disable node to I2C Queue */
    if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[idx]) != HAL_OK)
    {
      return LPBAM_ERROR;
    }

    /* Update node index */
    idx++;


    /*
     *               ######## Set I2C Timing ########
     */

    /* Set node descriptor */
    config_node.NodeDesc.NodeInfo.NodeID = (uint32_t)LPBAM_I2C_TIMING_ID;
    config_node.NodeDesc.pSrcVarReg      = &pDescriptor->pReg[idx];

    /* Set specific parameters for node creation */
    config_node.Config.Timing            = pTxFull->Timing;

    /* Fill descriptor for lpbam configuration transaction */
    if (LPBAM_I2C_FillNodeConfig(&config_node, &dma_node_conf) != LPBAM_OK)
    {
      return LPBAM_ERROR;
    }

    /* Build timing node */
    if (HAL_DMAEx_List_BuildNode(&dma_node_conf, &pDescriptor->pNodes[idx]) != HAL_OK)
    {
      return LPBAM_ERROR;
    }

    /* Insert timing node to I2C Queue */
    if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[idx]) != HAL_OK)
    {
      return LPBAM_ERROR;
    }

    /* Update node index */
    idx++;


    /*
     *               ######## Enable I2C Instance ########
     */

    /* Set node descriptor */
    config_node.NodeDesc.NodeInfo.NodeID = (uint32_t)LPBAM_I2C_STATE_ID;
    config_node.NodeDesc.pSrcVarReg      = &pDescriptor->pReg[idx];

    /* Set specific parameters for node creation */
    config_node.Config.State             = ENABLE ;
    config_node.Config.WakeupIT          = pTxFull->WakeupIT;

    /* Fill descriptor for lpbam configuration transaction */
    if (LPBAM_I2C_FillNodeConfig(&config_node, &dma_node_conf) != LPBAM_OK)
    {
      return LPBAM_ERROR;
    }

