STMicroelectronics/STM32CubeU5/Utilities/lpbam/stm32_adv_lpbam_i2c.c
    /* Build enable node */
    if (HAL_DMAEx_List_BuildNode(&dma_node_conf, &pDescriptor->pNodes[idx]) != HAL_OK)
    {
      return LPBAM_ERROR;
    }

    /* Insert enable node to I2C Queue */
    if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[idx]) != HAL_OK)
    {
      return LPBAM_ERROR;
    }

    /* Update node index */
    idx++;
  }
  else
  {
    /* Update node index */
    idx = I2C_SLAVE_DATA_NODEIDX;
  }


  /*
   *               ######## Configure I2C transfer ########
   */

  /* Set I2C instance */
  config_node.pInstance                  = pInstance;

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID   = (uint32_t)LPBAM_I2C_CONFIG_TRANSACTION_ID;
  config_node.NodeDesc.NodeInfo.NodeType = pDMAListInfo->QueueType;
  config_node.NodeDesc.pSrcVarReg        = &pDescriptor->pReg[idx];

  /* Set specific parameters for node creation */
  config_node.Config.Mode                = LPBAM_I2C_SLAVE_RECEIVE_MODE;
  config_node.Config.Size                = pRxFull->Size;
  config_node.Config.AddressingMode      = pRxFull->AddressingMode;
  config_node.Config.StopConditionState  = DISABLE;

  /* Fill node configuration */
  if (LPBAM_I2C_FillNodeConfig(&config_node, &dma_node_conf) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build configuration node */
  if (HAL_DMAEx_List_BuildNode(&dma_node_conf, &pDescriptor->pNodes[idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Connect configuration node to Queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Update node index */
  idx++;


  /*
   *               ######## I2C Receive Data ########
   */

  /* Get data buffer address */
  buffer_address                       = (uint32_t)&pRxFull->pData[buffer_offset];

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID = (uint32_t)LPBAM_I2C_RECEIVE_DATA_ID;
  config_node.NodeDesc.pBuff           = (uint32_t *)buffer_address;

  /* Fill node configuration */
  if (LPBAM_I2C_FillNodeConfig(&config_node, &dma_node_conf) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build receive data node */
  if (HAL_DMAEx_List_BuildNode(&dma_node_conf, &pDescriptor->pNodes[idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Connect receive data node to Queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Reload data transfer */
  if (is_reload_data == 1U)
  {
    buffer_offset += LPBAM_I2C_MAX_DATA_SIZE;
  }
  /* Reload data transfer */
  else
  {
    /* Reset buffer offset variable */
    buffer_offset = 0U;
  }

  return LPBAM_OK;
}

/**
  * @brief  Build the I2C master stop condition full nodes in DMA linked-list queue.
  * @param  pInstance    : [IN]  Pointer to a I2C_TypeDef structure that selects I2C instance.
  * @param  pDMAListInfo : [IN]  Pointer to a LPBAM_DMAListInfo_t structure that contains DMA instance and linked-list
  *                              queue type information.
  * @param  pDescriptor  : [IN]  Pointer to a LPBAM_I2C_MasterStopGenDesc_t structure that contains master stop
  *                              condition descriptor information.
  * @param  pQueue       : [OUT] Pointer to a DMA_QListTypeDef structure that contains DMA linked-list queue
  *                              information.
  * @retval LPBAM Status : [OUT] Value from LPBAM_Status_t enumeration.
  */
LPBAM_Status_t ADV_LPBAM_I2C_MasterStopGeneration_SetFullQ(I2C_TypeDef                   *const pInstance,
                                                           LPBAM_DMAListInfo_t           const *const pDMAListInfo,
                                                           LPBAM_I2C_MasterStopGenDesc_t *const pDescriptor,
                                                           DMA_QListTypeDef              *const pQueue)
{
  LPBAM_I2C_ConfNode_t config_node;
  DMA_NodeConfTypeDef  dma_node_conf;
  uint8_t idx = 0U;

  /*
   *               ######## I2C Stop Generation ########
   */

  /* Set I2C instance */
  config_node.pInstance                  = pInstance;

  /* Set node descriptor */
  config_node.NodeDesc.NodeInfo.NodeID   = (uint32_t)LPBAM_I2C_CONFIG_TRANSACTION_ID;
  config_node.NodeDesc.NodeInfo.NodeType = pDMAListInfo->QueueType;
  config_node.NodeDesc.pSrcVarReg        = &pDescriptor->pReg[idx];

  /* Set specific parameters for node creation */
  config_node.Config.StopConditionState  = ENABLE;

  /* Fill configuration node */
  if (LPBAM_I2C_FillNodeConfig(&config_node, &dma_node_conf) != LPBAM_OK)
  {
    return LPBAM_ERROR;
  }

  /* Build configuration node */
  if (HAL_DMAEx_List_BuildNode(&dma_node_conf, &pDescriptor->pNodes[idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  /* Insert configuration node to I2C Queue */
  if (HAL_DMAEx_List_InsertNode_Tail(pQueue, &pDescriptor->pNodes[idx]) != HAL_OK)
  {
    return LPBAM_ERROR;
  }

  return LPBAM_OK;
}

/**
  * @brief  Enable the I2C DMA requests.
  * @param  pInstance    : [IN]  Pointer to a I2C_TypeDef structure that selects I2C instance.
  * @retval LPBAM Status : [OUT] Value from LPBAM_Status_t enumeration.
  */
LPBAM_Status_t ADV_LPBAM_I2C_EnableDMARequests(I2C_TypeDef *const pInstance)
{
  /* Enable I2C reload and sequential events DMA request */
  pInstance->AUTOCR |= LPBAM_I2C_TCDMAEN | LPBAM_I2C_TCRDMAEN;

  /* Set I2C DMA requests and, auto clear flags and wake up enable */
  pInstance->CR1 |= LPBAM_I2C_RXDMAEN | LPBAM_I2C_TXDMAEN | LPBAM_I2C_STOPFACLR | LPBAM_I2C_ADDRACLR | LPBAM_I2C_WUPEN;

  return LPBAM_OK;
}
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#endif /* LPBAM_I2C_MODULE_ENABLED */
